# В этом задании для отработки присвоения типа данных для объектов, я сделаю это в виде вопросов
# для заполнения анкеты. Получив нужные данные, я попрошу интерпретатор вывести эти данные на экран.

print("Добро пожаловать! Для дальнешей работы Вам потребуется ответить на несколько вопрос!")

firstname = input("Введите ваше Имя: ")
lastname = input("Введите вашу Фамилию: ")
age = int(input("Сколько вам полных лет?: "))
occupation =input("Кем вы являетесь по профессии?: ")

print(firstname, lastname)
print(age, "полных лет")
print("По профессии", occupation)




